package bg.tu_varna.sit.b1.f23621718.contracts.loggers;

/**
 * Интерфейс, дефиниращ функционалност за логване на съобщения.
 * <p>
 * Използва се за извеждане на текстова информация като част от логическата или диагностична информация на приложението.
 */
public interface Logger {

    /**
     * Логва подаденото съобщение.
     * <p>
     * Реализацията може да включва извеждане на съобщението в конзолата, запис във файл, база от данни и др.
     *
     * @param message Съобщението, което ще бъде логнато.
     */
    void log(String message);
}