package bg.tu_varna.sit.b1.f23621718.contracts.models;

/**
 * Интерфейс, който дефинира обект от XML съдържание, притежаващо уникален идентификатор (ID).
 * <p>
 * Използва се за обекти, които трябва да бъдат идентифицирани еднозначно в рамките на XML структурата.
 */
public interface XMLContentWithId {

    /**
     * Връща уникалния идентификатор на XML съдържанието.
     *
     * @return Идентификаторът като {@link String}.
     */
    String getId();

    /**
     * Задава уникалния идентификатор на XML съдържанието.
     *
     * @param id Идентификаторът като {@link String}.
     */
    void setId(String id);
}

