package bg.tu_varna.sit.b1.f23621718.contracts.validators;

/**
 * Интерфейс за валидиране на стойности от произволен тип.
 * <p>
 * Интерфейсът дефинира метод, който проверява дали дадена стойност от тип {@code T}
 * удовлетворява определени условия или правила за валидност.
 *
 * @param <T> Типът на стойността, която ще се валидира.
 */
public interface Validator<T> {

    /**
     * Валидира подадената стойност.
     *
     * @param value Стойността за валидиране.
     * @return {@code true}, ако стойността е валидна; {@code false} в противен случай.
     */
    boolean validate(T value);
}

