package bg.tu_varna.sit.b1.f23621718.contracts.menu;

import bg.tu_varna.sit.b1.f23621718.contracts.io_handlers.IOHandler;

/**
 * Интерфейс, дефиниращ основната функционалност на меню в приложението.
 * <p>
 * Използва се за стартиране и управление на меню логиката, както и за взаимодействие с входно-изходната система.
 */
public interface BaseMenu {

    /**
     * Извежда от приложението или меню системата.
     * <p>
     * Може да се използва за прекратяване на програмата или връщане към предходно меню.
     */
    void exit();

    /**
     * Стартира менюто и неговата логика.
     * <p>
     * Обикновено представлява основен цикъл за въвеждане и обработка на команди от потребителя.
     */
    void startMenu();

    /**
     * Връща входно-изходния обработчик, използван от менюто.
     *
     * @return IOHandler екземпляр, отговарящ за четене и логване на информация.
     */
    IOHandler getIOHandler();
}
